BEGIN;

INSERT INTO professors(professor_id, university_id, professor_surname, professor_name, professor_patronymic, professor_birth_date) VALUES
	(1, 1, 'Березин', 'Михаил', 'Георгиевич', '1980-01-12'),
	(2, 1, 'Орлов', 'Даниил', 'Русланович', '1981-02-24'),
	(3, 1, 'Петров', 'Богдан', 'Егорович', '1982-03-27'),
	(4, 2, 'Соловьев', 'Дамир', 'Львович', '1983-04-12'),
	(5, 2, 'Карпов', 'Олег', 'Максимович', '1984-06-09'),
	(6, 2, 'Черных', 'Владислав', 'Яковлев', '1985-07-17'),
	(7, 3, 'Петухов', 'Борис', 'Сергеевич', '1986-09-04'),
	(8, 4, 'Бычков', 'Алексей', 'Иванович', '1987-10-26'),
	(9, 5, 'Казаков', 'Данила','Григорьевич', '1988-11-11'),
	(10, 6, 'Иванов', 'Дмитрий', 'Лукич', '1989-12-03')
	ON CONFLICT DO NOTHING;

END;